app/views/devise/registrations/edit.html.erb

SELECT "users".* FROM "users" WHERE "users"."partner_id" = ? ORDER BY "users"."id" ASC LIMIT 1  [["partner_id", 3]]
---
  <%= f.label :partner %><br />
  <%= f.select :partner_id, User.where("id NOT IN (?)", @user.id).sort_by(&:username).collect {|x| [x.username, x.id]} %></div>