app/views/homespaces/_form.html.erb

    <%= f.input :title %><br />
    <p>(We suggest something like <%= [current_user.username, "and", current_user.partner.username].join("-").downcase %>)</p>
---
SELECT "users".* FROM "users" WHERE "users"."partner_id" = ? ORDER BY "users"."id" ASC LIMIT 1  [["partner_id", 1]]