app/views/homespaces/show.html.erb

SELECT "posts".id FROM "posts" WHERE "posts"."homespace_id" = ?  [["homespace_id", 1]]
---
  <ul>
  <% @homespace.posts.each do |post| %>