app/views/users/index.html.erb

    <td><%= user.role %></td>
    <td><%= User.find(user.partner_id).username if user.partner_id && User.exists?(user.partner_id) %></td>
---
SELECT "users".* FROM "users" WHERE "users"."partner_id" = ? ORDER BY "users"."id" ASC LIMIT 1  [["partner_id", 3]]
SELECT 1 AS one FROM "users" WHERE "users"."id" = 2 LIMIT 1