app/controllers/homespaces_controller.rb

  def index
    @homespaces = Homespace.all
---
SELECT "homespaces".* FROM "homespaces"

  def create
    @homespace = Homespace.new(homespace_params)

    respond_to do |format|
      if @homespace.save
---
INSERT INTO "homespaces" ("created_at", "partner_id", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", Thu, 22 Aug 2013 00:18:15 UTC +00:00], ["partner_id", 2], ["updated_at", Thu, 22 Aug 2013 00:18:15 UTC +00:00], ["user_id", 1]]

  def update
    respond_to do |format|
      if @homespace.update(homespace_params)
---
UPDATE "homespaces" SET "title" = ?, "updated_at" = ? WHERE "homespaces"."id" = 1  [["title", "admin1-and-guest1"], ["updated_at", Thu, 22 Aug 2013 00:24:56 UTC +00:00]]

    def set_homespace
      @homespace = Homespace.find(params[:id])
---
SELECT "homespaces".* FROM "homespaces" WHERE "homespaces"."id" = ? LIMIT 1  [["id", "1"]]