app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("author_id", "body", "category", "created_at", "homespace_id", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)