app/controllers/users/registrations_controller.rb

    def set_user
      @user = User.find(params[:format])
---
SELECT "users".* FROM "users" WHERE "users"."id" = 4 ORDER BY "users"."id" ASC LIMIT 1